# RenderingQuality Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RenderingQualitySettings..::..RenderingQuality Property
RenderingQualitySettings Class See Also
---
The quality applied for rendering.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RenderingQuality RenderingQuality { get; set; }
```

Visual Basic
---
```text
Public Property RenderingQuality As RenderingQuality
	Get
	Set
```

Visual C++
---
```text
public:
property RenderingQuality RenderingQuality {
	RenderingQuality get ();
	void set (RenderingQuality value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace